Revit 2027 API
IFCUserDefinedPropertySet.FindPropertyByName Method
 Returns property by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCUserDefinedProperty FindPropertyByName(
	string name
)
Public Function FindPropertyByName (
	name As String
) As IFCUserDefinedProperty
public:
IFCUserDefinedProperty^ FindPropertyByName(
	String^ name
)
member FindPropertyByName :
        name : string -> IFCUserDefinedProperty
Parameters
name String
 Name of the property to find.
Return Value
IFCUserDefinedProperty
 The property or null if not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace